#ifndef FISC_MSG_H__
#define FISC_MSG_H__

char* CASS_MSG_NO_MSG="Неопознанный код возврата";

char* CASS_MSG_1="неверный номер порта (допустимы 1 или 2)";
char* CASS_MSG_2="неверно задан параметр скорости (допустимы 1200, 2400, 4800, 9600)";
char* CASS_MSG_3="ошибка открытия порта (порт занят)";
char* CASS_MSG_4="ошибка создания блока управления устройства (DCB)";
char* CASS_MSG_5="ошибка инициализации порта";
char* CASS_MSG_6="программа не лицензирована для подключенного ЭККА с данным заводским номером.";
char* CASS_MSG_7="ошибка закрытия порта";

char* CASS_MSG_8="ошибка (слишком много знаков в строке > 23)";
char* CASS_MSG_9="неверный номер кассы (допускается от 1 до 5)";
char* CASS_MSG_10="ошибка связи с кассовым аппаратом (нет связи с кассой)";
char* CASS_MSG_11="нет подтверждения выполнения операции от ЭККА";
char* CASS_MSG_12="ошибка (порт не был инициализирован)";
char* CASS_MSG_13="рассинхронизация (фатальная ошибка)";

char* CASS_MSG_14="ошибка в параметрах команды";
char* CASS_MSG_15="неверный номер кассы (допускается от 1 до 5)";
char* CASS_MSG_16="ошибка связи с кассовым аппаратом (нет связи с кассой)";
char* CASS_MSG_17="нет подтверждения выполнения операции от ЭККА";
char* CASS_MSG_18="некорректно раставлены \";\"";
char* CASS_MSG_19="ошибка (порт не был инициализирован)";
char* CASS_MSG_20="программа не лицензирована";
char* CASS_MSG_21="рассинхронизация (фатальная ошибка)";

char* CASS_MSG_22="нет связи с ЭККА";
char* CASS_MSG_23="потеря связи с кассой";
char* CASS_MSG_24="неверный номер кассы (допускается от 1 до 5)";
char* CASS_MSG_25="ошибка (порт не был инициализирован)";

char* CASS_MSG_26="неверный номер кассы (допускается от 1 до 5)";
char* CASS_MSG_27="ошибка связи с кассовым аппаратом (нет связи с кассой)";
char* CASS_MSG_28="нет подтверждения выполнения операции от ЭККА";
char* CASS_MSG_29="ошибка (порт не был инициализирован)";
char* CASS_MSG_30="программа не лицензирована";
char* CASS_MSG_31="рассинхронизация (фатальная ошибка)";

char* CASS_MSG_50="ошибка (порт не был инициализирован)";
char* CASS_MSG_51="ошибка передачи данных";

char* CASS_MSG_52="неверный номер кассы (допускается от 1 до 5)";
char* CASS_MSG_53="ошибка (касса с указанным номером не подключена)";
char* CASS_MSG_54="ошибка (порт не был инициализирован)";
char* CASS_MSG_55="программа не лицензирована";
char* CASS_MSG_56="рассинхронизация (фатальная ошибка)";

char* CASS_PROMPT_1="";
char* CASS_INIT_OK ="";
char* CASS_INIT_BAD="";
 
#endif
