#include "AMS_HDR.h"
#pragma hdrstop


char *Names_l2[][2][4][2]=
{ {
{ { "один","два" },
  { "одна","две" },
  { "один","два" },
  { "один","два" } },
{ { "одна","две" },
  { "одна","две" },
  { "один","два" },
  { "один","два" } }
},
{
{ { "один","два" },
  { "одна","двi" },
  { "один","два" },
  { "один","два" } },
{ { "одна","двi" },
  { "одна","двi" },
  { "один","два" },
  { "один","два" } }
} };

char *Names_l20[][17]=
{
{ "три","четыре","п€ть","шесть","семь","восемь","дев€ть","дес€ть",
  "одиннадцать","двенадцать","тринадцать","четырнадцать","п€тнадцать",
  "шестнадцать","семнадцать","восемнадцать","дев€тнадцать"
},
{ "три","чотири","п'€ть","шiсть","сiм","вiсiм","дев'€ть","дес€ть",
  "одинадц€ть","дванадц€ть","тринадц€ть","чотирнадц€ть","п'€тнадц€ть",
  "шiстнадц€ть","сiмнадц€ть","вiсiмнадц€ть","дев'€тнадц€ть"
}
};

char *Names_l100[][8]=
{  { "двадцать","тридцать","сорок","п€тьдес€т","шестьдес€т",
     "семьдес€т","восемьдес€т","дев€носто" },
   { "двадц€ть","тридц€ть","сорок","п'€тьдес€т","шiстдес€т",
     "сiмдес€т","вiсiмдес€т","дев'€носто" }   };

char *Names_l1000[][9]=
{ { "сто","двести","триста","четыреста","п€тьсот",
    "шестьсот","семьсот","восемьсот","дев€тьсот"  },
  { "сто","двiстi","триста","чотириста","п'€тсот",
    "шiстсот","сiмсот","вiсiмсот","дев'€тсот"  }  }  ;

char *Names_m[][3][3]=
{ { { "тыс€ча","тыс€чи","тыс€ч", },
    { "миллион","миллиона","миллионов", },
    { "миллиард","миллиарда","миллиардов" }  },
  {
    { "тис€ча","тис€чi","тис€ч", },
    { "мiльйон","мiльйони","мiльйонiв", },
    { "мiлiард","мiлiарди","мiлiардiв" }  }  };

#ifdef KRB
char *Names_krb[]=
{ "карбованец" , "карбованца" , "карбованцев" } ;
#endif

char *Short_names_grn[]={"грн.","грн."} ;

char *Names_grv[][3]=
{
{ "гривн€" , "гривни" ,  "гривен" },
{ "гривн€" , "гривнi" ,  "гривень" }
};

char *Names_kop[][3]=
{
{ "копейка" , "копейки" ,  "копеек" },
{ "копiйка" , "копiйки" ,  "копiйок" }
};

char *Names_usd[]=
{ "доллар —Ўј" , "доллара —Ўј" , "долларов —Ўј" } ;

char Name_usd[]="USD" , Name_cnt[]="CNT",Name_kop[]="коп." ;

char *month_names[][12]=
{                   {   "€нвар€",
                        "феврал€",
                        "марта",
                        "апрел€",
                        "ма€",
                        "июн€",
                        "июл€",
                        "августа",
                        "сент€бр€",
                        "окт€бр€",
                        "но€бр€",
                        "декабр€"  } ,
                    {   "сiчн€",
                        "лютого",
                        "березн€",
                        "квiтн€",
                        "травн€",
                        "червн€",
                        "липн€",
                        "серпн€",
                        "вересн€",
                        "жовтн€",
                        "листопада",
                        "грудн€"  }
}  ;

char *month_names_im[][12]=
{                       {"январь",
                        "‘евраль",
                        "ћарт",
                        "јпрель",
                        "ћай",
                        "»юнь",
                        "»юль",
                        "јвгуст",
                        "—ент€брь",
                        "ќкт€брь",
                        "Ќо€брь",
                        "ƒекабрь" },
                    {   "—iчень",
                        "Ћютий",
                        "Ѕерезень",
                        " вiтень",
                        "“равень",
                        "„ервень",
                        "Ћипень",
                        "—ерпень",
                        "¬ересень",
                        "∆овтень",
                        "Ћистопад",
                        "√рудень"  }
} ;
char *yearstr[]={ "года" , "року" };
char *yearstr_im[]={ "год" , "рiк" };

